Reports/СвойстваИнтернетЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>СвойстваИнтернетЗаявок</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СвойстваИнтернетЗаявок/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("РазрешенныеПолномчиямиСайты", РазрешенныеПолномочиямиСайты());
КонецПроцедуры

Функция РазрешенныеПолномочиямиСайты()
	Рез = "";
	Зап = Новый Запрос();
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ПользователиПолномочия.ЗначениеПолномочия КАК ЗначениеПолномочия
	|ИЗ
	|	Справочник.Пользователи.Полномочия КАК ПользователиПолномочия
	|ГДЕ
	|	ПользователиПолномочия.ИмяПолномочия = &ИмяПолномочия
	|	И ПользователиПолномочия.Ссылка = &Ссылка";
	
	Зап.УстановитьПараметр("ИмяПолномочия", 	"Отчет.СвойстваИнтернетЗаявок.Макет.Инициатор");
	Зап.УстановитьПараметр("Ссылка",			ПараметрыСеанса.ТекущийПользователь);
	РезЗап = Зап.Выполнить();
	Если РезЗап.Пустой() Тогда
		Возврат Рез;
	КонецЕсли;
	Рез = РезЗап.Выгрузить().ВыгрузитьКолонку(0);
	Возврат Рез;
КонецФункции
